Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: if_variable
zh_cn: 判断变量的值

source: macro
zh_cn: 定义常量

source: return
zh_cn: 返回值

source: set_global_var
zh_cn: 设置全局变量

source: temp_var
zh_cn: 声明临时变量

source: add_to_list
zh_cn: 添加到列表

source: Changing Paths
zh_cn: 更改路径

source: clear_data_structure
zh_cn: 清除数据结构

source: clear_grid
zh_cn: 清除网格

source: create_grid
zh_cn: 创建网格

source: create_list
zh_cn: 创建列表

source: create_map
zh_cn: 创建映射数据

source: create_stack
zh_cn: 创建堆栈

source: free_data_structure
zh_cn: 释放数据结构

source: get_grid_value
zh_cn: 获取网格值

source: get_index_of_list_item
zh_cn: 获取列表项的索引

source: get_list_item_at
zh_cn: 获取指定索引的列表项

source: get_list_item_count
zh_cn: 获取列表项数目

source: get_map_value
zh_cn: 获取映射数据的值

source: if_data_structure_empty
zh_cn: 数据结构是否为空

source: if_data_structure_exists
zh_cn: 数据结构是否存在

source: insert_into_list
zh_cn: 插入列表

source: pop_stack
zh_cn: 出栈

source: push_onto_stack
zh_cn: 进栈

source: remove_from_list
zh_cn: 删除列表项

source: remove_map_entry
zh_cn: 删除映射入口

source: set_grid_value
zh_cn: 设置网格的值

source: set_map_value
zh_cn: 设置映射数据的值

source: draw_ellipse
zh_cn: 绘制楕圆

source: draw_gradient_ellipse
zh_cn: 绘制渐变楕圆

source: draw_gradient_rectangle
zh_cn: 绘制渐变矩形

source: draw_healthbar
zh_cn: 绘制血条

source: draw_instance_health
zh_cn: 绘制实例的血条

source: draw_instance_lives
zh_cn: 绘制生命数

source: draw_instance_score
zh_cn: 绘制实例的分数

source: Tilemaps
zh_cn: 贴图图块

source: draw_line
zh_cn: 绘制线条

source: draw_rectangle
zh_cn: 绘制矩形

source: draw_self
zh_cn: 绘制自身

source: draw_sprite
zh_cn: 绘制精灵

source: draw_sprite_transformed
zh_cn: 绘制变幻的精灵

source: Shader Constants
zh_cn: 着色器常量

source: draw_stacked_sprites
zh_cn: 绘制堆叠的精灵

source: draw_transformed_value
zh_cn: 绘制变幻的值

source: draw_value
zh_cn: 绘制值

source: set_draw_alpha
zh_cn: 设置绘制透明度

source: Skeletal Animations
zh_cn: 骨骼动画

source: set_draw_colour
zh_cn: 绘制绘制颜色

source: set_font
zh_cn: 设置字体

source: set_text_alignment
zh_cn: 设置文本对齐

source: close_ini_file
zh_cn: 关闭ini文件

source: copy_file
zh_cn: 复制文件

source: delete_file
zh_cn: 删除文件

source: User Generated Content
zh_cn: 用户生成内容

source: if_file_exists
zh_cn: 文件是否存在

source: load_buffer
zh_cn: 载入缓冲器

source: open_ini_file
zh_cn: 打开ini文件

source: read_ini_file
zh_cn: 读取ini文件

source: rename_file
zh_cn: 重命名文件

source: save_buffer
zh_cn: 保存缓冲器

source: write_to_ini_file
zh_cn: 写入ini文件

source: exit_game
zh_cn: 退出游戏

source: load_game
zh_cn: 载入游戏

source: restart_game
zh_cn: 重启游戏

source: save_game
zh_cn: 保存游戏

source: gamepad_get_axis
zh_cn: 获取手柄轴坐标

source: gamepad_get_connected
zh_cn: 获取手柄的连接状态

source: gamepad_get_count
zh_cn: 获取连接的手柄个数

source: gamepad_get_trigger
zh_cn: 获取手柄触发器的值

source: gamepad_set_axis_deadzone
zh_cn: 设置手柄轴的死区

source: if_gamepad_button_down
zh_cn: 手柄按键是否按住

source: if_gamepad_button_pressed
zh_cn: 手柄按键是否按下过

source: if_gamepad_button_released
zh_cn: 手柄按键是否松开了

source: call_parent_event
zh_cn: 调用父事件

source: call_user_event
zh_cn: 调用用户事件

source: change_object_instance
zh_cn: 更换物体

source: create_object_instance
zh_cn: 创建物体的实例

source: destroy_at_position
zh_cn: 销毁指定位置的实例

source: destroy_object_instance
zh_cn: 销毁实例

source: get_alarm
zh_cn: 获取计时器

source: get_instance_count
zh_cn: 获取物体的实例数目

source: get_instance_variable
zh_cn: 获取实例变量

source: if_instance_exists
zh_cn: 实例是否存在

source: set_alarm
zh_cn: 设置计时器

source: set_animation_speed
zh_cn: 设置动画速度

source: set_instance_alpha
zh_cn: 设置实例透明度

source: set_instance_colour
zh_cn: 设置实例混色

source: set_instance_rotation
zh_cn: 设置实例捆绑精灵的旋转角

source: set_instance_scale
zh_cn: 设置实例精灵放大倍数

source: set_instance_variable
zh_cn: 设置实例变量

source: set_sprite
zh_cn: 设置实例的绑定精灵

source: get_health
zh_cn: 获取血条值

source: get_lives
zh_cn: 获取生命数

source: get_score
zh_cn: 获取分数

source: set_health
zh_cn: 设置血条值

source: set_lives
zh_cn: 设置生命数

source: set_score
zh_cn: 设置分类

source: get_random_number
zh_cn: 获取随机数值

source: randomise
zh_cn: 随机设置随机种子

source: set_window_state
zh_cn: 设置窗口状态

source: show_debug_message
zh_cn: 显示调试信息

source: if_key_down
zh_cn: 是否按住键

source: if_key_pressed
zh_cn: 是否按下键

source: if_key_released
zh_cn: 是否松开键

source: if_mouse_down
zh_cn: 是否按住鼠标键

source: if_mouse_pressed
zh_cn: 是否按下鼠标键

source: if_mouse_released
zh_cn: 是否松开鼠标键

source: jump_to_point
zh_cn: 坐标跳到指定点

source: jump_to_start
zh_cn: 回到开始点

source: reverse
zh_cn: 反向运动

source: set_direction_fixed
zh_cn: 设置固定运动方向

source: set_direction_random
zh_cn: 设置随机方向

source: set_direction_variable
zh_cn: 设置方向变量

source: set_friction
zh_cn: 设置阻力

source: set_gravity_direction
zh_cn: 设置重力方向

source: set_gravity_force
zh_cn: 设置重力

source: set_point_direction
zh_cn: 设置指向一点的方向

source: set_speed
zh_cn: 设置移动速度

source: snap_position
zh_cn: 设置网格移动格子大小

source: wrap_around_room
zh_cn: 设置房间卷动

source: burst_particles
zh_cn: 迸发粒子

source: clear_particle_system
zh_cn: 清除粒子系统

source: create_particle_emitter
zh_cn: 创建粒子发射器

source: create_particle_system
zh_cn: 创建粒子系统

source: create_particle_type
zh_cn: 创建粒子类型

source: destroy_particle_emitter
zh_cn: 销毁粒子发射器

source: destroy_particle_system
zh_cn: 销毁粒子系统

source: destroy_particle_type
zh_cn: 销毁粒子系统

source: do_effect
zh_cn: 创建内置粒子效果

source: emit_particles
zh_cn: 发射粒子

source: pause_particle_system
zh_cn: 暂停粒子系统

source: set_emitter_region
zh_cn: 设置发射器区域

source: set_particle_alpha
zh_cn: 设置粒子透明度

source: set_particle_colour
zh_cn: 设置粒子颜色

source: set_particle_direction
zh_cn: 设置粒子方向

source: set_particle_gravity
zh_cn: 设置粒子加速度

source: set_particle_life
zh_cn: 设置粒子生命周期

source: set_particle_orientation
zh_cn: 设置粒子朝向

source: set_particle_shape
zh_cn: 设置粒子形状

source: set_particle_size
zh_cn: 设置粒子大小

source: set_particle_speed
zh_cn: 设置粒子移动速度

source: set_particle_sprite
zh_cn: 设置粒子精灵

source: set_secondary_particle
zh_cn: 设置第二粒子类型

source: update_particle_system
zh_cn: 更新粒子系统

source: get_path_follow_speed
zh_cn: 获取路径跟随速度

source: get_position_along_path
zh_cn: 获取路径上点的位置

source: set_path_follow_speed
zh_cn: 设置路径跟随速度

source: set_position_along_path
zh_cn: 设置路径上点的位置

source: start_following_path
zh_cn: 开始跟随路径

source: stop_following_path
zh_cn: 停止跟随路径

source: get_current_room
zh_cn: 获取当前的房间

source: go_to_next_room
zh_cn: 前往下一个房间

source: go_to_previous_room
zh_cn: 前往上一个房间

source: go_to_room
zh_cn: 前往指定房间

source: if_room_is_first
zh_cn: 是否第一个房间

source: if_room_is_last
zh_cn: 是否最后一个房间

source: restart_room
zh_cn: 重启房间

source: get_tile_at_pixel
zh_cn: 获取指定坐标的图块

source: get_tile_in_cell
zh_cn: 获取指定格子的图块

source: set_tile_at_pixel
zh_cn: 设置指定坐标的图块

source: set_tile_in_cell
zh_cn: 设置指定格子的图块

source: set_instance_timeline
zh_cn: 在实例中设置时间线

source: set_timeline_moment
zh_cn: 设置时刻

source: set_timeline_speed
zh_cn: 设置时间线速度

source: set_timeline_state
zh_cn: 设置时间线状态

source: decimal_to_integer
zh_cn: 取整

source: number_to_string
zh_cn: 数字转字符串

source: string_to_number
zh_cn: 字符串转数字

source: Achievements and Leaderboards
zh_cn: 成就和高分榜

source: Audio Buffers
zh_cn: 音频缓冲区

source: Audio Emitters
zh_cn: 音频发射器

source: Audio Listeners
zh_cn: 音频帧听器

source: Audio Synchronisation
zh_cn: 音频同步

source: <statement>
zh_cn: <语句>

source: return (argument0 * argument0);
zh_cn: return (argument0 * argument0); // 正常的计算面积

source: return 0;
zh_cn: return 0; // 在这里跳出

source: val = scr_sqr(amount);
zh_cn: val = scr_sqr(amount); // 传递变量amount，返回值赋值给val

source: Particle Systems
zh_cn: 粒子系统

source: Particle Types
zh_cn: 粒子类型

source: Simple Effects
zh_cn: 简单粒子效果

source: Primitive Building
zh_cn: 图元构建

source: Vertex Formats
zh_cn: 顶点格式

source: Vectors
zh_cn: 矢量

source: 在笔记本模式下滚动和平移是一样的，所以它会是足够直观且精确的因为你不需要使用滚动条。Note that when holding these buttons, you simply have to move the mouse - not click nor drag, just move - and that if there is a general shortcut that normally requires the use of the / or keys, you would use the Right keys of the keyboard instead.
zh_cn: 在笔记本模式下滚动和平移是一样的，所以它会是足够直观且精确的因为你不需要使用滚动条。请注意，当按住这些按钮时，你只需要 移动 鼠标 - 不是点击或拖拽，仅仅是移动 - 如果有一个需要使用含有 / or 的快捷键，你需要使用右 边的按键来实现。

source: 如果你正在一个笔记本电脑上使用GameMaker Studio 2，那么在IDE的顶端会有一个选项为平板模式（Laptop Mode）：
zh_cn: 如果你正在一个笔记本电脑上使用GameMaker Studio 2，那么在IDE的顶端会有一个选项为笔记本模式（Laptop Mode）：

source: 所有目标平台都有两个编译选项：一个是VM，它使用一个运行器来解释代码；另一个是YYC，是创建本机代码并编译可执行程序。请注意，YYC选项需要额外安装。更多信息请参阅章节 Required SDKs或在桌面目标平台的技术支持部分。
zh_cn: 所有目标平台都有两个编译选项：一个是VM，它使用一个运行器来解释代码；另一个是YYC，是创建本机代码并编译可执行程序。请注意，YYC选项需要额外安装。更多信息请参阅章节 必需的SDK或在桌面目标平台的技术支持部分。

source: 每个控制台目标平台都有两个编译选项，一个是使用运行器和解释代码的VM（虚拟机），另一个是创建本机代码和编译可执行文件的YYC（YoYo编译器）。请注意，YYC选项需要额外安装。For more information on setting up see the section on Required SDKs.
zh_cn: 每个控制台目标平台都有两个编译选项，一个是使用运行器和解释代码的VM（虚拟机），另一个是创建本机代码和编译可执行文件的YYC（YoYo编译器）。请注意，YYC选项需要额外安装。更多信息请参阅 必需的SDK.

source: 现在，一些思维敏锐的人就会察觉到，我们在此处两种方法都使用了（这也是常有的情况），但是，它仍然只是一组指令。但为什么会有31？因为5号位是32，其下所有的位就是31，这也是可能的最大余数，因此这就是我们使用位与运算的对象（我们也可以这样用((1<<5)-1），会使得32-1 = 31现在，如果我不理解二进制方法的话，代码会变成这样：
zh_cn: 现在，一些思维敏锐的人就会察觉到，我们在此处两种方法都使用了（这也是常有的情况），但是，它仍然只是一组指令。但为什么会有31？因为5号位是32，其下所有的位就是31，这也是可能的最大余数，因此这就是我们使用位与运算的物体（我们也可以这样用((1<<5)-1），会使得32-1 = 31现在，如果我不理解二进制方法的话，代码会变成这样：

source: 这个属性默认是开着的但是你也可以根据你的喜好把这个按钮切换为关闭状态。IDE中的笔记本模式融合了一些工具使得当你使用触控板的时候能够拥有更好的体验，简化了三个主要的鼠标交互：平移、缩放和滚动。It uses two modifier keys to do this: Left / and Left .
zh_cn: 这个属性默认是开着的但是你也可以根据你的喜好把这个按钮切换为关闭状态。IDE中的笔记本模式融合了一些工具使得当你使用触控板的时候能够拥有更好的体验，简化了三个主要的鼠标交互：平移、缩放和滚动。它使用两个控制键实现: 左 / 和 左 。

source: Debug Mode
zh_cn: 调试模式（Debug Modes）

source: ESCAPE
zh_cn: 退出键（Esc）

source: Real Numbers
zh_cn: 实数（Real Numbers）

source: Choose
zh_cn: 选择

source: Data
zh_cn: 数据

source: FPS
zh_cn: 帧每秒（FPS）

source: Option
zh_cn: 选项

source: Transform
zh_cn: 变换

source: Windows
zh_cn: 窗口
